/*
 *	@file	Game.h
 *	@brief	シーン切り替えを主にするクラス
 *	@date	2023-03-04
 *  @human  RyoNakamura
 */

#pragma once

#include "../ExtendLib/GameSystemObject/GameSystemObjects.h"
 
//　基底シーン
#include "Scenes/Scene/Scene.h"

//　派生シーン
#include "Scenes/PlayScene/PlayScene.h"


class Game
{
private:
//--------------------------------------------------------//
//変数の記述はここから                                    //
//--------------------------------------------------------//

	//　インプットシステム
	GameSystemObjects* pGameSystem;
	//　画面サイズ
	int screenWidth;
	int screenHeight;


//--------------------------------------------------------//
//シーン                                                  //
//--------------------------------------------------------//

	//　シーンのIDを取っておく変数
	SceneID	m_sceneID;
	//　その時処理するシーンを入れるポインタ変数
	Scene* m_nowScene;

//--------------------------------------------------------//
//デルタタイム                                            //
//--------------------------------------------------------//

	LONGLONG oldTime;
	LONGLONG nowTime;
	float deltaTime;
	bool firstWait;

public:
//--------------------------------------------------------//
//関数の記述はここから                                    //
//--------------------------------------------------------//
	
	//　デフォルト関数
	Game();					
	~Game();				

	void Init();		
	void Update();			
	void Draw();			
	void Finalize();

//--------------------------------------------------------//
//デルタタイム                                            //
//--------------------------------------------------------//
	//　計算
	void CalDelta();

//--------------------------------------------------------//
//セッター                                                //
//--------------------------------------------------------//
	void SetScreenSize(int width, int height);
	
	void SetGameSystemObject(GameSystemObjects* pObj);

//--------------------------------------------------------//
//シーンの新規作成                                        //
//--------------------------------------------------------//
	void NewScene();
};

